heavier/httperf/test1.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.035 --send-buffer=4096 --recv-buffer=16384 --wsesslog=1000,0.000,input.txt
Maximum connect burst length: 2

Total: connections 1000 requests 9409 replies 9183 test-duration 35.033 s

Connection rate: 28.5 conn/s (35.0 ms/conn, <=976 concurrent connections)
Connection time [ms]: min 1525.4 avg 13755.6 max 34904.1 median 10159.5 stddev 10548.6
Connection time [ms]: connect 157.3
Connection length [replies/conn]: 340.111

Request rate: 268.6 req/s (3.7 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 113.6 avg 262.1 max 303.0 stddev 67.1 (7 samples)
Reply time [ms]: response 81.7 transfer 0.0
Reply size [B]: header 217.0 content 2131.0 footer 0.0 (total 2348.0)
Reply status: 1xx=0 2xx=9183 3xx=0 4xx=0 5xx=0

CPU time [s]: user 21.30 system 13.73 (user 60.8% system 39.2% total 100.0%)
Net I/O: 629.4 KB/s (5.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 9183 
Session rate [sess/s]: min 0.20 avg 0.77 max 1.20 stddev 0.38 (27/27)
Session: avg 1.00 connections/session
Session lifetime [s]: 13.8
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 2 0 2