heavier/httperf/test4.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=54.69.236.149 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.035 --send-buffer=4096 --recv-buffer=16384 --wsesslog=1000,0.000,input.txt
Maximum connect burst length: 2

Total: connections 1000 requests 9597 replies 9362 test-duration 35.773 s

Connection rate: 28.0 conn/s (35.8 ms/conn, <=976 concurrent connections)
Connection time [ms]: min 1515.6 avg 14309.3 max 34760.2 median 10107.5 stddev 10770.6
Connection time [ms]: connect 422.8
Connection length [replies/conn]: 334.357

Request rate: 268.3 req/s (3.7 ms/req)
Request size [B]: 107.0

Reply rate [replies/s]: min 113.6 avg 261.6 max 301.4 stddev 67.1 (7 samples)
Reply time [ms]: response 89.0 transfer 0.0
Reply size [B]: header 217.0 content 2130.0 footer 0.0 (total 2347.0)
Reply status: 1xx=0 2xx=9362 3xx=0 4xx=0 5xx=0

CPU time [s]: user 21.55 system 14.22 (user 60.2% system 39.8% total 100.0%)
Net I/O: 628.1 KB/s (5.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 9362 
Session rate [sess/s]: min 0.20 avg 0.78 max 1.40 stddev 0.45 (28/28)
Session: avg 1.00 connections/session
Session lifetime [s]: 14.3
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 1 0 1 5 4 0 1 0 2 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0 2 1 2